STM32-SDR/STM32-SDR/STM32-SDR/src/TFT_Display.c
/*
 * TFT_Display.c
 *
 *  Created on: Dec 19, 2012
 *      Author: CharleyK
 */

#include 	"TFT_Display.h"
#include	"stm32f4xx_gpio.h"
#include	"stm32f4xx.h"
#include	"stm32f4xx_rcc.h"
#include	"stm32f4xx_fsmc.h"
#include	"stm32f4xx_tim.h"
#include	"AsciiLib.h"
#include	"main.h"
#include	"touch_pad.h"
#include 	"PSKDet.h"

#define LCD_REG      (*((volatile unsigned short *) 0x60000000))
#define LCD_RAM      (*((volatile unsigned short *) 0x60020000))

#define MAX_POLY_CORNERS   200
#define POLY_Y(Z)          ((int32_t)((Points + Z)->X))
#define POLY_X(Z)          ((int32_t)((Points + Z)->Y))
#define ABS(X)  ((X) > 0 ? (X) : -(X))

/* Global variables to set the written text color */
__IO uint16_t TextColor = 0x0000;
__IO uint16_t BackColor = 0xFFFF;
__IO uint16_t asciisize = 16;





uint16_t TimerPeriod    = 0;
uint16_t Channel1Pulse  = 0;
//****************************************************************************//
static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed);
//****************************************************************************//
TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
TIM_OCInitTypeDef  TIM_OCInitStructure;
//****************************************************************************//
void LCD_Reset(void)
{
	/* Power Down the reset */
	GPIO_WriteBit(GPIOB, GPIO_Pin_1, Bit_RESET);

	/* wait for a delay to insure registers erasing */
	TFT_Delay(0x4FFF);

	/* Power on the reset */
	GPIO_WriteBit(GPIOB, GPIO_Pin_1, Bit_SET);
}

void LCD_Init(void)
{
	LCD_CtrlLinesConfig();
	TFT_Delay(3000);

	LCD_Reset();
	TFT_Delay(3000);

	LCD_FSMCConfig();
	TFT_Delay(3000);
	TIM_Config();
	LCD_BackLight(100);

	LCD_WriteReg(0x00E5, 0x8000);
	LCD_WriteReg(0x0000, 0x0001);
	LCD_WriteReg(0x0001, 0x0100);
	LCD_WriteReg(0x0002, 0x0700);
	LCD_WriteReg(0x0003, 0x1030);
	LCD_WriteReg(0x0004, 0x0000);
	LCD_WriteReg(0x0008, 0x0202);
	LCD_WriteReg(0x0009, 0x0000);
	LCD_WriteReg(0x000A, 0x0000);
	LCD_WriteReg(0x000C, 0x0000);
	LCD_WriteReg(0x000D, 0x0000);
	LCD_WriteReg(0x000F, 0x0000);

	LCD_WriteReg(0x0010, 0x0000);
	LCD_WriteReg(0x0011, 0x0000);
	LCD_WriteReg(0x0012, 0x0000);
	LCD_WriteReg(0x0013, 0x0000);

	LCD_WriteReg(0x0010, 0x17B0);
	LCD_WriteReg(0x0011, 0x0037);
	TFT_Delay(50); // Delay 50ms
	LCD_WriteReg(0x0012, 0x013B);
	TFT_Delay(50); // Delay 50ms
	LCD_WriteReg(0x0013, 0x1800);
	LCD_WriteReg(0x0029, 0x000F);
	TFT_Delay(50); // Delay 50ms
	LCD_WriteReg(0x0020, 0x0000);
	LCD_WriteReg(0x0021, 0x0000);

	LCD_WriteReg(0x0030, 0x0000);
	LCD_WriteReg(0x0031, 0x0007);
	LCD_WriteReg(0x0032, 0x0103);
	LCD_WriteReg(0x0035, 0x0407);
	LCD_WriteReg(0x0036, 0x090F);
	LCD_WriteReg(0x0037, 0x0404);
	LCD_WriteReg(0x0038, 0x0400);
	LCD_WriteReg(0x0039, 0x0404);
	LCD_WriteReg(0x003C, 0x0000);
	LCD_WriteReg(0x003D, 0x0400);

	LCD_WriteReg(0x0050, 0x0000);
	LCD_WriteReg(0x0051, 0x00EF);
	LCD_WriteReg(0x0052, 0x0000);
	LCD_WriteReg(0x0053, 0x013F);
	LCD_WriteReg(0x0060, 0x2700);
	LCD_WriteReg(0x0061, 0x0001);
	LCD_WriteReg(0x006A, 0x0000);

	LCD_WriteReg(0x0080, 0x0000);
	LCD_WriteReg(0x0081, 0x0000);
	LCD_WriteReg(0x0082, 0x0000);
	LCD_WriteReg(0x0083, 0x0000);
	LCD_WriteReg(0x0084, 0x0000);
	LCD_WriteReg(0x0085, 0x0000);

	LCD_WriteReg(0x0090, 0x0010);
	LCD_WriteReg(0x0092, 0x0000);
	LCD_WriteReg(0x0093, 0x0003);
	LCD_WriteReg(0x0095, 0x0110);
	LCD_WriteReg(0x0097, 0x0000);
	LCD_WriteReg(0x0098, 0x0000);
	LCD_WriteReg(0x0007, 0x0173);
}

void LCD_WriteRAM_Prepare(void)
{
	LCD_REG =   0x22;
}

void LCD_WriteRAM(uint16_t RGB_Code)
{
	LCD_RAM = RGB_Code;
}

void LCD_WriteReg(uint8_t LCD_Reg, uint16_t LCD_RegValue)
{
	LCD_REG = LCD_Reg;
	LCD_RAM = LCD_RegValue;
}

void LCD_DisplayOn(void)
{
	LCD_WriteReg(0x07, 0x0173);
}

void LCD_DisplayOff(void)
{
	LCD_WriteReg(0x07, 0x0000);
}

void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
	TextColor = _TextColor;
	BackColor = _BackColor;
}

void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
	*_TextColor = TextColor; *_BackColor = BackColor;
}

void LCD_SetTextColor(__IO uint16_t Color)
{
	TextColor = Color;
}

void LCD_SetBackColor(__IO uint16_t Color)
{
	BackColor = Color;
}

/* 8x8=8 12x12=12 8x16=16 12x12=14 16x24=24 */
void LCD_CharSize(__IO uint16_t size)
{
	asciisize= size;
}

void LCD_Clear(uint16_t Color)
{
	uint32_t index = 0;
	LCD_SetCursor(0x00, 0x00);
	LCD_WriteRAM_Prepare();
	for(index = 0; index <76800; index++)
	{
		LCD_RAM = Color;
		TFT_Delay(200);

	}
}


//February
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
	//LCD_WriteReg(0x21, Xpos);
	//LCD_WriteReg(0x20, Ypos);
	LCD_WriteReg(0x20, Xpos);
	LCD_WriteReg(0x21, Ypos);

}

//February
void PutPixel(int16_t x, int16_t y)
{
	if (( x > 319 )||( y > 239 )) return;
	//if (( x > 239 )||( y > 319 )) return;
	LCD_SetCursor(y, x);
	LCD_WriteRAM_Prepare();
	LCD_WriteRAM(TextColor);
}

//February
void Pixel(int16_t x, int16_t y,int16_t c)
{
	if (( x > 319 )||( y > 239 )) return;
	//if (( x > 239 )||( y > 319 )) return;
	LCD_SetCursor(y,x);
	LCD_WriteRAM_Prepare();
	LCD_WriteRAM(c);
}

//void Display_ULong ( uint16_t data, uint8_t XL, uint8_t YL)	{

//	XL = XL+32; // Based on 16 bit being limited to 65000( 5-1 places * 8 pixels)

//	while ( data > 0 )	{

//		//LCD_Write_Character ( ( data % 10 ) + 0x30, col--, row, invert );
//		LCD_PutChar(XL, YL, ( data % 10+ 0x30 ));
//        XL  -= 8;
//		data	/=	10;
//		}
//	}


//February
void LCD_PutChar(int16_t PosX, int16_t PosY, char c)
{
	uint8_t i = 0;
	uint8_t j = 0;
	if(asciisize==8)
	{
		uint8_t  Buffer[8];
		uint8_t TmpChar = 0;

		GetASCIICode1(Buffer,c);
		for (i=0;i<8;i++)
		{
			TmpChar = Buffer[i];
			for (j=0;j<8;j++)
			{
				if ( ((TmpChar >> (7-j)) & 0x01) == 0x01)
				{
					Pixel(PosX +j, PosY + (7-i), TextColor);
				}
				else
				{
					Pixel(PosX + j, PosY + (7-i), BackColor);
				}
			}
		}
	}
	//----------------------------------------------------------------------------
	if(asciisize==12)
	{
		uint8_t Buffer[12];
		uint8_t TmpChar = 0;

		GetASCIICode2(Buffer,c);
		for (i=0;i<12;i++)
		{
			TmpChar = Buffer[i];
			for (j=0;j<8;j++)
			{
				if ( ((TmpChar >> (7-j)) & 0x01) == 0x01)
				{
					Pixel(PosX +j, PosY + (11-i), TextColor);
				}
				else
				{
					Pixel(PosX + j, PosY + (11-i), BackColor);
				}
			}
		}
	}
	//----------------------------------------------------------------------------
	if(asciisize==16)
	{
		unsigned char Buffer[16];
		uint8_t TmpChar = 0;

		GetASCIICode4(Buffer,c);
		for (i=0;i<16;i++)
		{
			TmpChar = Buffer[i];
			for (j=0;j<8;j++)
			{
				if ( ((TmpChar >> (7-j)) & 0x01) == 0x01)
				{
					Pixel(PosX +j, PosY + (15-i), TextColor);

