STM32-SDR/STM32-SDR/STM32-SDR/src/TFT_Display.c
	/*  Loop through the rows of the image. */
	for (pixelY = IMAGE_TOP; pixelY < IMAGE_BOTTOM; pixelY++)
	{
		/* Build a list of nodes. */
		nodes = 0; j = PointCount-1;

		for (i = 0; i < PointCount; i++)
		{
			if (((POLY_Y(i)<(double) pixelY) && (POLY_Y(j)>=(double) pixelY)) || \
					((POLY_Y(j)<(double) pixelY) && (POLY_Y(i)>=(double) pixelY)))
			{
				nodeX[nodes++]=(int) (POLY_X(i)+((pixelY-POLY_Y(i))*(POLY_X(j)-POLY_X(i)))/(POLY_Y(j)-POLY_Y(i)));
			}
			j = i;
		}

		/* Sort the nodes, via a simple "Bubble" sort. */
		i = 0;
		while (i < nodes-1)
		{
			if (nodeX[i]>nodeX[i+1])
			{
				swap = nodeX[i];
				nodeX[i] = nodeX[i+1];
				nodeX[i+1] = swap;
				if(i)
				{
					i--;
				}
			}
			else
			{
				i++;
			}
		}

		/*  Fill the pixels between node pairs. */
		for (i = 0; i < nodes; i+=2)
		{
			if(nodeX[i] >= IMAGE_RIGHT)
			{
				break;
			}
			if(nodeX[i+1] > IMAGE_LEFT)
			{
				if (nodeX[i] < IMAGE_LEFT)
				{
					nodeX[i]=IMAGE_LEFT;
				}
				if(nodeX[i+1] > IMAGE_RIGHT)
				{
					nodeX[i+1] = IMAGE_RIGHT;
				}
				LCD_SetTextColor(BackColor);
				LCD_DrawLine(pixelY, nodeX[i+1], nodeX[i+1] - nodeX[i], LCD_DIR_HORIZONTAL);
				LCD_SetTextColor(TextColor);
				PutPixel(pixelY, nodeX[i+1]);
				PutPixel(pixelY, nodeX[i]);
				/* for (j=nodeX[i]; j<nodeX[i+1]; j++) PutPixel(j,pixelY); */
			}
		}
	}

	/* draw the edges */
	LCD_SetTextColor(TextColor);
}



void LCD_BackLight(int procentai)
{
	if (procentai>100)
	{procentai=100;}
	else if(procentai<0)
	{procentai=0;}
	Channel1Pulse =(uint16_t)(((uint32_t)procentai*(TimerPeriod-1))/100);
	TIM_TimeBaseStructure.TIM_Period = TimerPeriod;
	TIM_OCInitStructure.TIM_Pulse = Channel1Pulse;
	TIM_OC1Init(TIM1, &TIM_OCInitStructure);
}

void TIM_Config(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOA  , ENABLE);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP ;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource8, GPIO_AF_TIM1);
	TimerPeriod = (SystemCoreClock / 17570 ) - 1;
	Channel1Pulse = (uint16_t) (((uint32_t) 99 * (TimerPeriod - 1)) / 100);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1 , ENABLE);
	TIM_TimeBaseStructure.TIM_Prescaler = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseStructure.TIM_Period = TimerPeriod;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;
	//TIM_OCInitStructure.TIM_Pulse = Channel3Pulse;
	TIM_OCInitStructure.TIM_Pulse = Channel1Pulse;
	TIM_OC3Init(TIM1, &TIM_OCInitStructure);
	TIM_Cmd(TIM1, ENABLE);
	TIM_CtrlPWMOutputs(TIM1, ENABLE);

}
//this function has been modified for the ILI9320 display. It has not really been tested
//nor reviewed for horizotal / vertical switch in February


void LCD_SetDisplayWindow(uint8_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
	if(Xpos >= Height)
	{
		LCD_WriteReg(0x0050, (Xpos - Height +1));  //Window X start address
	}
	else
	{
		LCD_WriteReg(0x0050, 0x0000);
	}
	if(Ypos >= Width)
	{
		LCD_WriteReg(0x0052, (Ypos - Width +1));  //Window Y start address
	}
	else
	{
		LCD_WriteReg(0x0052, 0x0000);
	}
	LCD_WriteReg(0x0053, Ypos);   //Window Y end address
	LCD_SetCursor(Xpos, Ypos);

}




void TFT_Delay(uint32_t nTime)
{

	static __IO uint32_t TimingDelay ;
	TimingDelay = nTime;

	while(TimingDelay != 0)
	{
		TimingDelay --;
	}
}

void Plot_String (  uint8_t *string, uint8_t x, uint8_t y )	{

	while ( *string )	{

		LCD_PutChar(x, y, *string++);

		x	+=	8;

	}
}


void Plot_Integer ( int16_t number, uint8_t x, uint8_t y )	{

	uint8_t	buffer[11] = "         0", index = 9, sign = 0;
	//   "0123456,789"
	if ( number < 0 )	{

		number = -number;

		sign = 1;

	}

	while ( number > 0 ) {

		buffer [ index-- ] = number % 10 + 0x30;

		number /= 10;

		if ( ( index == 6 || index == 2 ) && number > 0 ) buffer [ index-- ] = ',';

	}

	if ( sign == 1 ) buffer [ index ] = '-';

	//Plot_String ( buffer, x, y );
	LCD_StringLine(x,y,(char*) &buffer[0]);

}

void Plot_Freq ( uint32_t number, uint8_t x, uint8_t y )	{

	uint8_t	buffer[11] = "         0", index = 9;
	//   "0123456789"


	while ( number > 0 ) {

		buffer [ index-- ] = number % 10 + 0x30;

		number /= 10;

		if ( index == 6   ) buffer [ index-- ] = '.';

	}
	LCD_StringLine(x,y,(char*) &buffer[0]);
	//Plot_String ( buffer, x, y );

}
